In [1]:
import pandas as pd
import numpy as np

import datetime
from datetime import datetime, date

In [2]:
sp500 = pd.read_csv("data/sp500.csv", 
                    index_col='Symbol', 
                    usecols=[0, 2, 3, 7])
sp500

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897
...                        ...     ...         ...
YHOO    Information Technology   35.02      12.768
YUM     Consumer Discretionary   74.77       5.147
ZMH                Health Care  101.84      37.181
ZION                Financials   28.43      30.191
ZTS                Health Care   30.53       2.150

[500 rows x 3 columns]

In [3]:
#add row
s = sp500[:3].copy()
s.loc['FOO'] = ['the sector', 100, 110]
s

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954
FOO      the sector  100.00     110.000

In [4]:
# merge
yhoo_mmm = sp500.loc[['YHOO','MMM']]
msft = sp500.loc[['MSFT']]
yhoo_mmm.append(msft)

                        Sector   Price  Book Value
Symbol
YHOO    Information Technology   35.02      12.768
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [5]:
# merge
ym = sp500.loc[['YHOO','MMM']]
msft = sp500.loc[['MSFT']]
pd.concat([ym, msft])

                        Sector   Price  Book Value
Symbol
YHOO    Information Technology   35.02      12.768
MMM                Industrials  141.14      26.668
MSFT    Information Technology   40.12      10.584

In [6]:
# merge
pd.concat([ym, msft], keys=['a', 'b'])

                          Sector   Price  Book Value
  Symbol
a YHOO    Information Technology   35.02      12.768
  MMM                Industrials  141.14      26.668
b MSFT    Information Technology   40.12      10.584

In [8]:
df3 = pd.DataFrame(np.arange(9).reshape(3, 3),columns=['a', 'b', 'c'])
df4 = pd.DataFrame(np.arange(20, 26).reshape(3, 2), columns=['a', 'd'], index=[2, 3, 4])
pd.concat([df3, df4])

    a    b    c     d
0   0  1.0  2.0   NaN
1   3  4.0  5.0   NaN
2   6  7.0  8.0   NaN
2  20  NaN  NaN  21.0
3  22  NaN  NaN  23.0
4  24  NaN  NaN  25.0

In [9]:
pd.concat([df3, df4], axis=1)

     a    b    c     a     d
0  0.0  1.0  2.0   NaN   NaN
1  3.0  4.0  5.0   NaN   NaN
2  6.0  7.0  8.0  20.0  21.0
3  NaN  NaN  NaN  22.0  23.0
4  NaN  NaN  NaN  24.0  25.0

In [9]:
pd.concat([df3, df4], axis=1, join='inner')

   a  b  c   a   d
2  6  7  8  20  21

In [10]:
customers = {'CustomerID': [10, 11],
             'Name': ['Mike', 'Marcia'],
             'Address': ['Address for Mike',
                         'Address for Marcia']}
customers = pd.DataFrame(customers)
customers

   CustomerID    Name             Address
0          10    Mike    Address for Mike
1          11  Marcia  Address for Marcia

In [11]:
orders = {'CustomerID': [10, 11, 10],
          'OrderDate': [date(2014, 12, 1),
                        date(2014, 12, 1),
                        date(2014, 12, 1)]}
orders = pd.DataFrame(orders)
orders

   CustomerID   OrderDate
0          10  2014-12-01
1          11  2014-12-01
2          10  2014-12-01

In [12]:
customers.merge(orders)

   CustomerID    Name             Address   OrderDate
0          10    Mike    Address for Mike  2014-12-01
1          10    Mike    Address for Mike  2014-12-01
2          11  Marcia  Address for Marcia  2014-12-01

In [15]:
left_data = {'key1': ['a', 'b', 'c'], 
            'key2': ['x', 'y', 'z'],
            'lval1': [ 0, 1, 2]}
right_data = {'key1': ['a', 'b', 'c'],
              'key2': ['x', 'a', 'z'], 
              'rval1': [ 6, 7, 8 ]}
left_df = pd.DataFrame(left_data, index=[0, 1, 2])
right_df = pd.DataFrame(right_data, index=[1, 2, 3])
left_df

  key1 key2  lval1
0    a    x      0
1    b    y      1
2    c    z      2

In [16]:
right_df

  key1 key2  rval1
1    a    x      6
2    b    a      7
3    c    z      8

In [17]:
#inner join default
left_df.merge(right_df)

  key1 key2  lval1  rval1
0    a    x      0      6
1    c    z      2      8

In [17]:
#outer join
left_df.merge(right_df, how='outer')

  key1 key2  lval1  rval1
0    a    x    0.0    6.0
1    b    y    1.0    NaN
2    c    z    2.0    8.0
3    b    a    NaN    7.0

In [18]:
#left join
left_df.merge(right_df, how='left')

  key1 key2  lval1  rval1
0    a    x      0    6.0
1    b    y      1    NaN
2    c    z      2    8.0

In [19]:
#right join
left_df.merge(right_df, how='right')

  key1 key2  lval1  rval1
0    a    x    0.0      6
1    c    z    2.0      8
2    b    a    NaN      7